app/Http/Controllers/Owner/AppointmentController.php

    public function index(Request $request)
    {
        // save old filter settings
        $oldFilterStatus = -9999;
        $oldFilterPitchArea = -9999;
        $oldFilterDate = -9999;

        // get all id of pitch areas belong to this user
        $query = PitchArea::select('id', 'name')
            ->where('user_id', auth()->user()->id);

        // process status array
        $arrStatus = StatusOrderEnum::getArrayView();
        // process pitch area array
        $arrPitchArea = $query->get();

        // process request pitch area
        if ($request->has('pitcharea')) {
            if ($request->pitcharea != 'All') {
                $query->where('id', $request->pitcharea);
                $oldFilterPitchArea = $request->pitcharea;
            }
        }


        $pitchAreas = $query->get();
---
select `id`, `name` from `pitch_areas` where `user_id` = 2


        foreach ($pitchAreas as $pitchArea) {
            // get all id of pitches belong to this pitch area
            $pitches = Pitch::select('id')
                ->where('pitch_area_id', $pitchArea->id)
                ->get();
---
select `id` from `pitches` where `pitch_area_id` = 2

    public function store(StoreRequest $request)
    {
        $arr = $request->validated();
        try{
            // split time slot
            $arrTimeSlot = explode(' ', $arr['timeslots']);

            // get type from pitch
            $type = Pitch::where('id', $request->pitch)
                            ->value('type');

            // get cost from times
            $arrCost = Time::select('timeslot', 'cost')
                            ->where('pitch_area_id', $request->pitcharea)
                            ->where('type', $type)
                            ->whereIn('timeslot', $arrTimeSlot)
                            ->get();

            // save order records
            foreach($arrCost as $each){
                Order::create([
                    'name' => $arr['name'],
                    'phone' => $arr['phone'],
                    'price' => $each->cost,
                    'status' => StatusOrderEnum::PROCESSING,
                    'require' => $arr['require'],
                    'pitch_id' => $arr['pitch'],
                    'timeslot' => $each->timeslot,
                    'created_at' => \Carbon\Carbon::now()->toDateTimeString()
                ]);
---
select `type` from `pitches` where `id` = '6' limit 1
select `timeslot`, `cost` from `times` where `pitch_area_id` = 2 and `type` = 11 and `timeslot` not in ('05:00-06:00', '06:00-07:00')
insert into `orders` (`name`, `phone`, `price`, `status`, `require`, `pitch_id`, `timeslot`, `created_at`) values ('Anh Quân Lý', '0123456789', 120000, 0, '', '6', '09:00-10:00', '2023-10-23 14:06:24')

    public function getTimeslotFree(Request $request): JsonResponse
    {


        // get pitch area id and type to process next step
        $pitch = Pitch::select('pitch_area_id', 'type')
            ->where('id', $request->pitchId)
            ->first();

         // catch object not of this owner
         if(!checkPitchAreaBelongThisUser(auth()->user()->id, $pitch->pitch_area_id)){
            return $this->errorResponse('mày đùa với bố m à');
        }

        // get will do and timeslot in pitch times
        $pitch_time = PitchTime::select('timeslot')
            ->where('pitch_id', $request->pitchId)
            ->where('will_do', $request->willdo)
            ->get()
            ->toArray();

        $times = Time::select('timeslot', 'cost')
            ->where('pitch_area_id', $pitch->pitch_area_id)
            ->where('type', $pitch->type)
            ->whereNotIn('timeslot', $pitch_time)
            ->get();
---
select `pitch_area_id`, `type` from `pitches` where `id` = '6' limit 1
select `timeslot` from `pitch_times` where `pitch_id` = '6' and `will_do` = '2023-10-23'
select `timeslot`, `cost` from `times` where `pitch_area_id` = 2 and `type` = 11 and `timeslot` not in ('05:00-06:00', '06:00-07:00')