app/Http/Controllers/Owner/PitchAreaController.php

    public function showPitch($pitchAreaId)
    {
        // check if pitch area is belong to this users
        if (!checkPitchAreaBelongThisUser(auth()->user()->id, $pitchAreaId)) {
            return redirect()->route('owner.pitchareas.index');
        }

        // check if pitch area is exists
        $pitchArea = PitchArea::where('id', $pitchAreaId)
            ->value('name');
---
select `name` from `pitch_areas` where `id` = '2' limit 1

    public function getPitchArea()
    {
        $pitchArea = PitchArea::select('id', 'name')
            ->where('user_id', auth()->user()->id)
            ->get();
---
select `id`, `name` from `pitch_areas` where `user_id` = 2