app/Http/Controllers/Owner/PitchController.php

    public function getPitch($pitchAreaId): JsonResponse
    {
        if (!checkPitchAreaBelongThisUser(auth()->user()->id, $pitchAreaId)) {
            return $this->errorResponse('Dô cc à thằng ngu');
        }

        $pitches = Pitch::select('id', 'name', 'type')
                        ->where('pitch_area_id', $pitchAreaId)
                        ->get();
---
select `id`, `name`, `type` from `pitches` where `pitch_area_id` = '2'