app/Helpers/function.php

    function checkPitchAreaBelongThisUser($user_id, $pitch_area_id): bool
    {
        $checkExists = PitchArea::query()
            ->where('id', $pitch_area_id)
            ->where('user_id', $user_id)
            ->exists();
---
select exists(select * from `pitch_areas` where `id` = 2 and `user_id` = 2) as `exists`

    function getNamePitchArea($pitch_area_id): string
    {
        $res = PitchArea::where('id', $pitch_area_id)
            ->value('name');
---
select `name` from `pitch_areas` where `id` = 2 limit 1